archieve/flowPastSquareCylinder/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.75e-4;

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform 1.75e-04;
    }

    outlet          
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    walls
    {
        type            fixedValue;
        value           uniform 0;
    }

    sides
    {
        type            fixedValue;
        value           uniform 0;
    }

    lowerUpper
    {
        type            fixedValue;
        value           uniform 0;
    }

}

// ************************************************************************* //
